## Staging: rds
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               NAME                                |
|--------|-------------------------------------------------------------------|
| add    | `aws_rds_cluster_instance.notification-canada-ca-blazer-readonly` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_rds_cluster_instance.notification-canada-ca-blazer-readonly will be created
  + resource "aws_rds_cluster_instance" "notification-canada-ca-blazer-readonly" {
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = false
      + availability_zone                     = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + cluster_identifier                    = "notification-canada-ca-staging-cluster"
      + copy_tags_to_snapshot                 = false
      + db_parameter_group_name               = (known after apply)
      + db_subnet_group_name                  = "notification-canada-ca-staging"
      + dbi_resource_id                       = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "aurora-postgresql"
      + engine_version                        = "11.21"
      + engine_version_actual                 = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "notification-staging-blazer-instance"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.r6g.large"
      + kms_key_id                            = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + network_type                          = (known after apply)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + preferred_backup_window               = (known after apply)
      + preferred_maintenance_window          = "wed:04:00-wed:04:30"
      + promotion_tier                        = 0
      + publicly_accessible                   = false
      + storage_encrypted                     = (known after apply)
      + tags                                  = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all                              = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + writer                                = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + blazer_rds_endpoint                = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_event_subscription.notification-canada-ca-cluster"]
WARN - plan.json - main - Missing Common Tags: ["aws_db_subnet_group.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-blazer-readonly"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_instance.notification-canada-ca-instances[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.default"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.app_db_user"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_user"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_cloudwatch_log_group.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy.this[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_only\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_db_proxy_endpoint.this[\"read_write\"]"]
WARN - plan.json - main - Missing Common Tags: ["module.rds_proxy.aws_iam_role.this[0]"]

35 tests, 19 passed, 16 warnings, 0 failures, 0 exceptions

```

</details>
